/* 2151298 信11 杨滕超 */
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：
	 功    能：将整数n分解后输出
	 输入参数：
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n)
{
	int a, b;
	if (n < 10 && n >0)
		cout << char(n+48) << " ";
	/*只有一个数字直接输出，对应的数字字符ASCII码要+48*/
	else if (n >= 10)
	{
		convert(n / 10);
		cout <<char( n %10+48) << " ";
	}
	/*多个数字情况，有输出，有递归*/
	else if(n>-214783648)
	{
		cout << "- ";
		n = -n;
		convert(n);
	}
	/*转化成正数，加个负号*/
	else
	{
		a = 2000000000;
		b = a + n;//也可以用%把2砍头
		cout << "- ";
		convert(a / 1000000000);
		convert(-b);
	}
	/*分解其中一个位数*/
}
void convert2(int n)
{
	if (n / 10)
		convert2(n / 10);
	cout << (char)('0' + n % 10)<<" ";//'0'等同于48
}
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	cout << "请输入一个整数" << endl;
	cin >> n;

	convert(n);
	cout << endl;

	return 0;
}