/* 2151298 信11 杨滕超 */
#include <iostream>
#include <iomanip>
#include <math.h>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：给定x，返回 y=2x^3-9x^2+12-3的值
  输入参数：
  返 回 值：
  说    明：函数名为f，返回值、输入参数自行定义
***************************************************************************/
double f(double x)
{
	return (2 * x * x * x - 9 * x * x + 12 * x - 3);
}

/***************************************************************************
  函数名称：
  功    能：求方程y=2x^3-9x^2+12-3在[0..1]之间的根
  输入参数：
  返 回 值：
  说    明：调用f函数求各y=f(x)的值
***************************************************************************/
double fun(double x1, double x2)
{
	double x=1;
	
	while (fabs(f(x)) >= 1e-6)
	{
		x = (x1 + x2) * 0.5;
		if (f(x) > 0)
		{
			x2 = x;

		}
		else
		{
            x1 = x;

		}
			
	}
	return x;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main不准动
***************************************************************************/
int main()
{
	/* 打印方程在[0..1]之间的根 */
	cout << "x=" << setiosflags(ios::fixed) << setprecision(3) << fun(0, 1) << endl;
	return 0;
}