/* 2151298 信11 杨滕超 */
#include <iostream>
#include <limits>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：输入一个符合要求的整数
  输入参数：根据no值x，打印“请输出第x个int型整数”
  返 回 值：
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
int get_int(int no)
{
	int x;
	while (1)
	{
		cout << "请输入第" << no << "个int型整数" << endl;
		cin >> x;
		while (cin.fail())
		{
			cin.clear();
			cin.ignore(std::numeric_limits<int>::max(), '\n');
			cout << "请输入第" << no << "个int型整数" << endl;
			cin >> x;
		}
		if (x)
			break;
	}

	return x;
}

/***************************************************************************
  函数名称：
  功    能：将四个数按从小到大顺序输出
  输入参数：
  返 回 值：
  说    明：函数名、形参、返回类型不准修改
***************************************************************************/
void output(int a, int b, int c, int d)
{
	int x, y, z, w;
	if (a < b) {//x<y
		x = a;
		y = b;
	}

	else {
		x = b;
		y = a;

	}
	if (c < d) {//z<w
		z = c;
		w = d;
	}
	else {
		z = d;
		w = c;
	}
	if (y < z)
		cout << "从小到大依次是 : " << x << " " << y << " " << z << " " << w << endl;
	else if (w < x)
		cout << "从小到大依次是 : " << z << " " << w << " " << x << " " << y << endl;
	else if (x < z && w < y)
		cout << "从小到大依次是 : " << x << " " << z << " " << w << " " << y << endl;
	else if (z < x && y < w)
		cout << "从小到大依次是 : " << z << " " << x << " " << y << " " << w << endl;
	else if (x < z && y < w)
		cout << "从小到大依次是 : " << x << " " << z << " " << y << " " << w << endl;
	else if (z < x && w < y)
		cout << "从小到大依次是 : " << z << " " << x << " " << w << " " << y << endl;
	
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main不准动
***************************************************************************/
int main()
{
	int a, b, c, d;

	a = get_int(1);
	b = get_int(2);
	c = get_int(3);
	d = get_int(4);

	output(a, b, c, d);

	return 0;
}